const Map<String, String> prayerDescriptions = {
  'fajr':
      'صلاة الفجر أو صلاة الصبح ركعتان يُجهر بهما، وفي الحديث: «من صلى العشاء في جماعة فكأنما قام نصف الليل، ومن صلى الصبح في جماعة فكأنما صلى الليل كله» [أخرجه مسلم]، وقال صلى الله عليه وسلم أيضًا: «من صلى الصبح فهو في ذمة الله» [أخرجه مسلم وراتبتها ركعتان قبلها؛ قال صلى الله عليه وسلم في فضلهما: «ركعتا الفجر خير من الدنيا وما فيها» [أخرجه مسلم].',

  'dhuhr':
      'هي أربع ركعات تُصلى سرًّا. ويُسن صلاة ركعتين أو أربع ركعات قبلها، وركعتين بعدها ، وفي الحديث من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرمه الله على النار» [أخرجه أصحاب السنن]. وقد بشر النبي صلى الله عليه وسلم من صلى الرواتب، ومن ضمنها أربع ركعات قبل الظهر وركعتان بعدها، ببناء بيت في الجنة فقال: «ما من عبد مسلم يصلي لله كل يوم ثنتي عشرة ركعة تطوعًا غير فريضة إلا بنى الله له بيتًا في الجنة» [أخرجه مسلم].',

  'asr':
      'هى أربع ركعات تُصلى سرًّا. ولصلاة العصر فضل كبير، فهي الصلاة الوسطى، وقال صلى الله عليه وسلم: «الذي تفوته صلاة العصر، كأنما وُتر أهله وماله» [أخرجه البخاري ومسلم] أي من لا يؤديها في وقتها كأنما هو بلا أهل ولا مال وليس للعصر سنة راتبة مؤكدة ولكن يستحب الصلاة قبلها لقوله صلى الله عليه وسلم: «بين كل أذانين صلاة» [أخرجه البخاري ومسلم].',

  'maghrib':
      'هي ثلاث ركعات تُصلى الركعتان الأوليان جهرًا، والأخيرة سرا. وتعجيل صلاة المغرب والمبادرة إليها في أول وقتها أفضل من تأخيرها وراتبتها ركعتان بعدها.',

  'isha':
      'هي أربع ركعات تُصلى الركعتان الأوليان جهرًا، والأخيرتان سرا. وراتبتها ركعتان بعدها. وفي الحديث: «من صلى العشاء في جماعة فكأنما قام نصف الليل، ومن صلى الصبح فى جماعة فكأنما صلى الليل كله» [أخرجه مسلم].',
};
